---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalThermalResistance
source: html/73daf06b-19f2-f414-1da4-8ab0f0e97090.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalThermalResistance Property

"Thermal Resistance (R)"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalThermalResistance { get; }
```